lib/xml/modifyCampaignProfile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:modifyCampaignProfile>
            <!--Optional:-->
            <campaignProfile>
                <!--Optional:-->
                <ANI>?</ANI>
                <!--Optional:-->
                <description>?</description>
                <!--Optional:-->
                <dialingSchedule>
                    <!--Optional:-->
                    <dialASAPSortOrder>?</dialASAPSortOrder>
                    <!--Optional:-->
                    <dialASAPTimeout>?</dialASAPTimeout>
                    <!--Optional:-->
                    <dialASAPTimeoutPeriod>?</dialASAPTimeoutPeriod>
                    <!--Optional:-->
                    <dialingOrder>?</dialingOrder>
                    <!--Zero or more repetitions:-->
                    <dialingSchedules>
                        <!--Optional:-->
                        <number>?</number>
                        <!--Optional:-->
                        <startTime>
                            <days>?</days>
                            <hours>?</hours>
                            <minutes>?</minutes>
                            <seconds>?</seconds>
                        </startTime>
                        <!--Optional:-->
                        <stopTime>
                            <days>?</days>
                            <hours>?</hours>
                            <minutes>?</minutes>
                            <seconds>?</seconds>
                        </stopTime>
                    </dialingSchedules>
                    <!--Zero or more repetitions:-->
                    <includeNumbers>?</includeNumbers>
                </dialingSchedule>
                <!--Optional:-->
                <dialingTimeout>?</dialingTimeout>
                <!--Optional:-->
                <initialCallPriority>?</initialCallPriority>
                <!--Optional:-->
                <maxCharges>?</maxCharges>
                <!--Optional:-->
                <name>?</name>
                <!--Optional:-->
                <numberOfAttempts>?</numberOfAttempts>
            </campaignProfile>
        </ser:modifyCampaignProfile>
    </soapenv:Body>
</soapenv:Envelope>